%% 内点法求解约束非线性最优化问题
% 将方程组转换为残差形式
residuals = @(x) biological_interactions(x)
    
% 定义目标函数（残差的平方和）
objective = @(x) sum(residuals(x).^2)
y = randi([0, 3], 1, 14);
y0=[0.03, 0.03, 0.03, 0.03, 0.03, 0.03, 0.03, 0.03, 0.03, 0.03, 0.03, 0.03, 0.03, 0.03];
y=[y,y0];
for i=1:10000
    x0 = randi([0, 10], 1, 14);   
    x1 = [0.03, 0.03, 0.03, 0.03, 0.03, 0.03, 0.03, 0.03, 0.03, 0.03, 0.03, 0.03, 0.03, 0.03];
    x0 = [x0, x1];
    % 没有线性或非线性约束，因此 A, b, Aeq, beq, lb, ub 均为空
    A = -eye(28);
    b = zeros(28, 1);
%     A = [];
%     b = [];
    Aeq = [];
    beq = [];
    lb = []; % 如果有变量下界，则在这里定义
    ub = []; % 如果有变量上界，则在这里定义
    % 使用 fmincon 求解
        options = optimoptions('fmincon', 'Display', 'iter', 'Algorithm', 'sqp');
        [x, fval] = fmincon(objective, x0, A, b, Aeq, beq, lb, ub, [], options);
        x0 = round(x * 10^4) / 10^4;
        % 显示结果
        disp('Solution:');
        disp(x0);
        disp('Objective function value at the solution:');
        disp(fval);

        % 检查残差是否足够小
        residual_norm = norm(residuals(x));
        disp(['Residual norm:', num2str(residual_norm)]);

        % 如果残差足够小，可以认为找到了方程组的解
        if residual_norm < 1e-1
            disp('The solution is considered acceptable.');
            y = [y;x0];
        else
            disp('The solution may not be accurate enough.');
        end
end
tabulate(y(:,1))

% %% 非线性最小二乘求解非线性方程组
% x0 =randi([0, 3], 1, 28);  % 你的初始猜测值
% options = optimoptions('fsolve','Display','iter','Algorithm','levenberg-marquardt');%'trust-region-dogleg',  'trust-region',  or 'levenberg-marquardt'
% y0 = fsolve(@biological_interactions, x0, options);
% y=y0;
% flag=[0];
% for i=1:1000
%     x1 = randi([0, 3], 1, 28);
%     options = optimoptions('fsolve','Display','iter','Algorithm','levenberg-marquardt');
%     [y1,fval,exitflag] = fsolve(@biological_interactions, x1, options);
%     y=[y;y1];
%     flag = [flag;exitflag];
% end
% y=[y,flag];

% [3.08389725293406,1.09897978544851,1.09906178071578,1.09533172982160,5.27080561784446,1.14312001496412,1.09906178770270,1.00809075312500,5.12550966057191,3.12387913336852,3.03374972798992,0.164634559326937,1.13697688416546,6.15563361571449e-15,0.0300000000000000,0.0300000000000000,0.0300000000000000,0.0300000000000000,4.95876646345197,0.0300000000000000,0.0299999999999999,0.0297197974691158,0.0300000000000000,0.0302361876129064,0.0302655899007002,0.0300000000000000,0.0300000000000000,1.00000000000000,1]
% [3.18554098381210,1.09898018702481,1.09851412687297,1.09576281933053,4.52110552346914,1.14437149248092,1.09851412687286,1.97620208532647,5.12617129004484,3.12456192832875,3.03410657505845,0.164379337204067,1.13625921202820,0.969292486731593,0.0300000000000000,0.0300000000000000,0.0300000000000000,0.0300000000000000,0.0306901157010121,0.0300000000000000,0.0349171751726492,0.0151753897348182,0.0300000000000000,0.0302359808787129,0.0302654647133690,0.0300000000000000,0.0300000000000000,2.36451825930887e-15,1]
%% 新网络
function F = biological_interactions(x) %the biological interactions between genes
a=1.1;
b=2;
k=1;
n=3;
r=0.01;
s=0.5;
e=0.03;
F(1)=a*x(4)^n/(s^n+x(4)^n)+a*x(5)^n/(s^n+x(5)^n)+a*x(8)^n/(s^n+x(8)^n)-k*x(1);
F(2)=a*x(9)^n/(s^n+x(9)^n)-k*x(2);
F(3)=a*x(5)^n/(s^n+x(5)^n)-k*x(3);
F(4)=a*x(1)^n/(s^n+x(1)^n)-k*x(4);
F(5)=a*x(1)^n/(s^n+x(1)^n)+a*x(2)^n/(s^n+x(2)^n)+a*x(3)^n/(s^n+x(3)^n)+a*x(13)^n/(s^n+x(13)^n)+b*s^n/(s^n+x(9)^n)+b*s^n/(s^n+x(10)^n)+b*s^n/(s^n+x(6)^n)+b*s^n/(s^n+x(14)^n)-k*x(5)+r*(x(5)*(((x(5)-6.2847)^2+(x(8)-1.0072)^2)-((x(5)-5.4976)^2+(x(8)-1.440)^2)-((x(5)-4.5274)^2+(x(8)-1.9732)^2)-0.5)-2*e*((x(5)-6.2847)-(x(5)-5.4976)-(x(5)-4.5274))*x(19)+0.5*e*x(5)*x(19)*(-2));
F(6)=a*x(1)^n/(s^n+x(1)^n)+a*x(12)^n/(s^n+x(12)^n)+b*s^n/(s^n+x(5)^n)+b*s^n/(s^n+x(10)^n)-k*x(6);
F(7)=a*x(5)^n/(s^n+x(5)^n)-k*x(7);
F(8)=a*x(2)^n/(s^n+x(2)^n)+a*x(14)^n/(s^n+x(14)^n)+b*s^n/(s^n+x(9)^n)-k*x(8)+r*(x(8)*(((x(5)-6.2847)^2+(x(8)-1.0072)^2)-((x(5)-5.4976)^2+(x(8)-1.440)^2)-((x(5)-4.5274)^2+(x(8)-1.9732)^2)-0.5)-2*e*((x(8)-1.0072)-(x(8)-1.440)-(x(8)-1.9732))*x(22)+0.5*e*x(8)*x(22)*(-2));
F(9)=a*x(2)^n/(s^n+x(2)^n)+a*x(3)^n/(s^n+x(3)^n)+a*x(4)^n/(s^n+x(4)^n)+a*x(6)^n/(s^n+x(6)^n)+a*x(1)^n/(s^n+x(1)^n)-k*x(9);
F(10)=a*x(1)^n/(s^n+x(1)^n)+a*x(2)^n/(s^n+x(2)^n)+a*x(6)^n/(s^n+x(6)^n)+b*s^n/(s^n+x(10)^n)-k*x(10);
F(11)=b*s^n/(s^n+x(11)^n)+a*x(2)^n/(s^n+x(2)^n)+a*x(4)^n/(s^n+x(4)^n)+a*x(6)^n/(s^n+x(6)^n)-k*x(11);
F(12)=b*s^n/(s^n+x(5)^n)+b*s^n/(s^n+x(6)^n)+b*s^n/(s^n+x(1)^n)-k*x(12);
F(13)=a*x(5)^n/(s^n+x(5)^n)+a*x(12)^n/(s^n+x(12)^n)-k*x(13);
F(14)=a*x(14)^n/(s^n+x(14)^n)-k*x(14);
F(15)=2*k*x(15)-2*e;
F(16)=2*k*x(16)-2*e;
F(17)=2*k*x(17)-2*e;
F(18)=2*k*x(18)-2*e;
F(19)=2*k*x(19)-2*e+r*((((x(5)-6.2847)^2+(x(8)-1.0072)^2)-((x(5)-5.4976)^2+(x(8)-1.440)^2)-((x(5)-4.5274)^2+(x(8)-1.9732)^2)-0.5)*x(19)+1.5*e*x(19)^2*(-2));
F(20)=2*k*x(20)-2*e;
F(21)=2*k*x(21)-2*e;
F(22)=2*k*x(22)-2*e+r*((((x(5)-6.2847)^2+(x(8)-1.0072)^2)-((x(5)-5.4976)^2+(x(8)-1.440)^2)-((x(5)-4.5274)^2+(x(8)-1.9732)^2)-0.5)*x(22)+1.5*e*x(22)^2*(-2));
F(23)=2*k*x(23)-2*e;
F(24)=2*(k-b*s^n*(n*x(10)^(n-1)/(s^n+x(10)^n)^2))*x(24)-2*e;
F(25)=2*(k-b*s^n*(n*x(11)^(n-1)/(s^n+x(11)^n)^2))*x(25)-2*e;
F(26)=2*k*x(26)-2*e;
F(27)=2*k*x(27)-2*e;
F(28)=2*(k-a*(n*x(14)^(n-1)*(s^n+x(14)^n)-n*x(14)^n*x(14)^(n-1))/(s^n+x(14)^n)^2)*x(21)-2*e;
end
